#include <stdio.h>

/*************************************************************
1100: 26부터 시작한다. 2+6 = 8이다. 새로운 수는 68이다. 6+8 = 14이다. 새로운 수는 84이다. 8+4 = 12이다. 새로운 수는 42이다. 4+2 = 6이다. 새로운 수는 26이다.

위의 예는 4번만에 원래 수로 돌아올 수 있다. 따라서 26의 사이클의 길이는 4이다.

N이 주어졌을 때, N의 사이클의 길이를 구하는 프로그램을 작성하시오.
 
오른쪽 값끼리 +하기 . 
    ( t_d * 10 ) + (u_d)

*************************************************************/
int main()
{
    static int cycle, sum;

    int n;
    int n_v;
    //place value
    int t_d, u_d, sum_u_d;
    scanf("%d", &n);
    n_v = n;

    do
    {
        u_d = n % 10;
        //십의자리 일의자리 나누는것.
        if ((n >= 0) && (n <= 99))
        {
            if (n < 10)
            {
                t_d = 0;
            }
            else if (n >= 10)
            {
                t_d = (n - u_d) / 10;
            }
        }

        sum = t_d + u_d;
        //sum 의 오른쪽 자리수 구하기.
        if (sum < 10)
        {
            sum_u_d = sum;
        }
        else if (n >= 10)
        {
            sum_u_d = sum % 10;
        }

        cycle++;

        n = (u_d * 10) + sum_u_d;
    } while (n_v != n);
    printf("%d", cycle);

    return 0;
}