/*************************************************************
2577번 abc 를 곱하여 나온값 11000000 이라면 1이 두번 0은 6번
각각의 숫자가 몇번 사용되었는지 구하는프로그램을 만들어보자   
1,000,000,000 최대값
**************************************************************/
#include <stdio.h>

int main(void)
{
    int a, b, c;
    int result;
    int arr[10] = {0};
    int index;
    scanf("%d", &a);
    scanf("%d", &b);
    scanf("%d", &c);
    result = a * b * c;

    while (result > 0)
    {
        index = result % 10;
        arr[index]++;
        result = result / 10;
    }
    for (int i = 0; i < 10; i++)
    {
        printf("%d\n", arr[i]);
    }
}
//정수를 자릿수에 따라 쪼개야 할때는 10으로 나눗셈과 나머지 연산을 하면 간단하게 처리가 가능하다 .
//for(int i = 0; i < 10 ;i++)를 사용했을때는 값이 이상하게 나왔다 나중에 다시한번 살펴보자